In [1]:
import pandas as pd

<ipython-input-1-7dd3504c366f>:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
lst=[1,2,3,4,5,6]
print(lst)

[1, 2, 3, 4, 5, 6]

In [3]:
series=pd.Series(lst)
print(series)
print(type(series))

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64
<class 'pandas.core.series.Series'>

In [4]:
empty=pd.Series([])
empty

Series([], dtype: object)

In [5]:
scalar_series=pd.Series(0.5,index=[1,2,3])
scalar_series

1    0.5
2    0.5
3    0.5
dtype: float64

In [6]:
dict_series=pd.Series({'p':1,'q':2,'r':3,'s':4})
dict_series

p    1
q    2
r    3
s    4
dtype: int64

In [7]:
dict_series[0:3]

p    1
q    2
r    3
dtype: int64

In [8]:
#Data Frame

In [9]:
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [10]:
df=pd.DataFrame(lst)
df

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [11]:
lst=([1,2,3,4,5,6],[11,12,13,14,15])
df=pd.DataFrame(lst)
df

    0   1   2   3   4    5
0   1   2   3   4   5  6.0
1  11  12  13  14  15  NaN

In [12]:
lst=([1,2,3,4,5,6],[11,12,13,14,15,16])
df=pd.DataFrame(lst)
df

    0   1   2   3   4   5
0   1   2   3   4   5   6
1  11  12  13  14  15  16

In [13]:
lst=[[1,2,3,4,5,6],[11,12,13,14,15]]
df=pd.DataFrame(lst)
df

    0   1   2   3   4    5
0   1   2   3   4   5  6.0
1  11  12  13  14  15  NaN

In [14]:
lst=([1,2,3,4,5],[11,12,13,14,15])
df=pd.DataFrame(lst)
df

    0   1   2   3   4
0   1   2   3   4   5
1  11  12  13  14  15

In [15]:
b={'Number':pd.Series([1,2,3,4,5]),
   'Maths':pd.Series([67,89,23,90,56]),
   'Physics':pd.Series([12,98,44,90,78])}
df=pd.DataFrame(b)
df

   Number  Maths  Physics
0       1     67       12
1       2     89       98
2       3     23       44
3       4     90       90
4       5     56       78

In [17]:
df=pd.read_csv(r'C:\code\c++\files\color_srgb.csv')
df

       Name      HEX               RGB
0     White  #FFFFFF  rgb(100,100,100)
1    Silver  #C0C0C0     rgb(75,75,75)
2      Gray  #808080     rgb(50,50,50)
3     Black  #000000        rgb(0,0,0)
4       Red  #FF0000      rgb(100,0,0)
5    Maroon  #800000       rgb(50,0,0)
6    Yellow  #FFFF00    rgb(100,100,0)
7     Olive  #808000      rgb(50,50,0)
8      Lime  #00FF00      rgb(0,100,0)
9     Green  #008000       rgb(0,50,0)
10     Aqua  #00FFFF    rgb(0,100,100)
11     Teal  #008080      rgb(0,50,50)
12     Blue  #0000FF      rgb(0,0,100)
13     Navy  #000080       rgb(0,0,50)
14  Fuchsia  #FF00FF    rgb(100,0,100)
15   Purple  #800080      rgb(50,0,50)